Tekla.Structures.Plugins.CustomPartBase.CustomPartPositioningType
Defines the type of the positioning.

Tekla.Structures.Plugins.CustomPartBase.CustomPartPositioningType.POSITIONING_BY_CENTER_OF_BOUNDING_BOX
Positioning happens based on total extrema of objects. Default value.
Same as "Use center of the bounding box in positioning" value on in custom component wizard

Tekla.Structures.Plugins.CustomPartBase.CustomPartPositioningType.POSITIONING_BY_INPUTPOINTS
Positioning happens based on input points and extrema of objects. Similar to exact positioning in custom parts
Same as "Use center of the bounding box in positioning" value off in custom component wizard